cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "birth_date" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "brown"], ["birth_date", "2000-02-01"], ["description", "UPDATED!"], ["updated_at", "2018-12-18 21:55:50.591119"], ["id", 2]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)